# ThermalResistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyThermalProperties..::..ThermalResistance Property
FamilyThermalProperties Class See Also
---
The calculated thermal resistance value (R-Value). The units are meter-squared kelvin per watt ((m^2*K)/Watt).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ThermalResistance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ThermalResistance As Double
	Get
```

Visual C++
---
```text
public:
property double ThermalResistance {
	double get ();
}
```

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace